# Parameter Type Id Make Surface From Closed Loops Property

Source: https://www.revitapidocs.com/2026/67de20bf-5f64-e8e0-abf4-633e9195105b.htm

---

| Parameter Type Id Make Surface From Closed Loops Property |
| --- |

"Make surface from closed loops"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId MakeSurfaceFromClosedLoops { get; }
```

```
Public Shared ReadOnly Property MakeSurfaceFromClosedLoops As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ MakeSurfaceFromClosedLoops {
	ForgeTypeId^ get ();
}
```

```
static member MakeSurfaceFromClosedLoops : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace